bsd-hacker/freebsd/cam_sim_alloc.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2016 M. Warner Losh
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd January 19, 2016
.Dt CAM_SIM_ALLOC 9
.Os
.Sh NAME
.Nm cam_sim_alloc
.Nd xxx blah
.Sh SYNOPSIS
.In cam/cam_sim.h
.Ft typedef void
.Fn "\*(lp*sim_action_func\*(rp" "struct cam_sim *sim" "union ccb *ccb"
.Ft typedef void
.Fn "\*(lp*sim_poll_func\*(rp" "struct cam_sim *sim"
.Ft struct cam_sim *
.Fn cam_sim_alloc "sim_action_func sim_action" "sim_poll_func sim_poll" "const char * sim_name" "void *softc" "u_int32_t unit" "struct mtx *mtx" "int max_dev_transactions" "int max_tagged_dev_transactions" "struct cam_devq *queue"
.Sh DESCRIPTION
Create a CAM SIM.
A SIM is a System Interface Module.
It processes CCBs with its
.Fn sim_action_func
as described in
.Xr cam.9 .
.Pp
The
.Fn sim_poll_func
is used to create crash dumps.
.Sh SEE ALSO
.Sh AUTHORS
This manual page was written by
.An M. Warner Losh .
